## Terraform Plan Result


### environments/stg/app/ec2
```
  + create
  + resource "aws_ami_from_instance" "this" {
      + architecture            = (known after apply)
      + arn                     = (known after apply)
      + boot_mode               = (known after apply)
      + ena_support             = (known after apply)
      + hypervisor              = (known after apply)
      + id                      = (known after apply)
      + image_location          = (known after apply)
      + image_owner_alias       = (known after apply)
      + image_type              = (known after apply)
      + imds_support            = (known after apply)
      + kernel_id               = (known after apply)
      + last_launched_time      = (known after apply)
      + manage_ebs_snapshots    = (known after apply)
      + name                    = "web-server-ami"
      + owner_id                = (known after apply)
      + platform                = (known after apply)
      + platform_details        = (known after apply)
      + public                  = (known after apply)
      + ramdisk_id              = (known after apply)
      + region                  = "ap-southeast-2"
      + root_device_name        = (known after apply)
      + root_snapshot_id        = (known after apply)
      + snapshot_without_reboot = false
      + source_instance_id      = "i-06e4b37170029b992"
      + sriov_net_support       = (known after apply)
      + tags                    = {
          + "Created_by"  = "Tong Viet Hoang"
          + "Environment" = "Staging"
          + "Project"     = "STP-2025"
      + tags_all                = {
          + "Created_by"  = "Tong Viet Hoang"
          + "Environment" = "Staging"
          + "Project"     = "STP-2025"
      + tpm_support             = (known after apply)
      + uefi_data               = (known after apply)
      + usage_operation         = (known after apply)
      + virtualization_type     = (known after apply)
      + ebs_block_device (known after apply)
      + ephemeral_block_device (known after apply)
  + resource "aws_launch_template" "this" {
      + arn             = (known after apply)
      + default_version = (known after apply)
      + id              = (known after apply)
      + image_id        = (known after apply)
      + instance_type   = "t3.micro"
      + key_name        = "hoang-key-pair"
      + latest_version  = (known after apply)
      + name            = (known after apply)
      + name_prefix     = "web-server-template"
      + region          = "ap-southeast-2"
      + tags_all        = (known after apply)
      + user_data       = "IyEvYmluL2Jhc2gKYXB0IHVwZGF0ZQphcHQgaW5zdGFsbCAteSBhcGFjaGUyCnN5c3RlbWN0bCBzdGFydCBhcGFjaGUyCnN5c3RlbWN0bCBlbmFibGUgYXBhY2hlMgoKYXB0IGluc3RhbGwgbXlzcWwtY2xpZW50IC15CgplY2hvICJQb3J0IDgwODAiIHwgc3VkbyB0ZWUgLWEgL2V0Yy9zc2gvc3NoZF9jb25maWcKc3VkbyBzeXN0ZW1jdGwgZW5hYmxlIHNzaApzdWRvIHN5c3RlbWN0bCBzdGFydCBzc2gK"
      + metadata_options (known after apply)
      + tag_specifications {
          + resource_type = "instance"
          + tags          = {
              + "Created_by"  = "Tong Viet Hoang"
              + "Environment" = "Staging"
              + "Name"        = "web-server-template"
              + "Project"     = "STP-2025"
Plan: 2 to add, 0 to change, 0 to destroy.
Changes to Outputs:
  ~ ami_id                         = "ami-026c60204237546ab" -> (known after apply)
  ~ launch_template_id             = "lt-047360671c98c9e63" -> (known after apply)
  ~ launch_template_latest_version = 1 -> (known after apply)
```
<!-- Sticky Pull Request Commentterraform-plan -->